{"format": "layers-model", "generatedBy": "keras v3.5.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.5.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_layer"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 15, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [null, 224, 224, 3]}}, "training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of49.bin", "group1-shard2of49.bin", "group1-shard3of49.bin", "group1-shard4of49.bin", "group1-shard5of49.bin", "group1-shard6of49.bin", "group1-shard7of49.bin", "group1-shard8of49.bin", "group1-shard9of49.bin", "group1-shard10of49.bin", "group1-shard11of49.bin", "group1-shard12of49.bin", "group1-shard13of49.bin", "group1-shard14of49.bin", "group1-shard15of49.bin", "group1-shard16of49.bin", "group1-shard17of49.bin", "group1-shard18of49.bin", "group1-shard19of49.bin", "group1-shard20of49.bin", "group1-shard21of49.bin", "group1-shard22of49.bin", "group1-shard23of49.bin", "group1-shard24of49.bin", "group1-shard25of49.bin", "group1-shard26of49.bin", "group1-shard27of49.bin", "group1-shard28of49.bin", "group1-shard29of49.bin", "group1-shard30of49.bin", "group1-shard31of49.bin", "group1-shard32of49.bin", "group1-shard33of49.bin", "group1-shard34of49.bin", "group1-shard35of49.bin", "group1-shard36of49.bin", "group1-shard37of49.bin", "group1-shard38of49.bin", "group1-shard39of49.bin", "group1-shard40of49.bin", "group1-shard41of49.bin", "group1-shard42of49.bin", "group1-shard43of49.bin", "group1-shard44of49.bin", "group1-shard45of49.bin", "group1-shard46of49.bin", "group1-shard47of49.bin", "group1-shard48of49.bin", "group1-shard49of49.bin"], "weights": [{"name": "sequential/conv2d/kernel", "shape": [3, 3, 3, 8], "dtype": "float32"}, {"name": "sequential/conv2d/bias", "shape": [8], "dtype": "float32"}, {"name": "sequential/dense/kernel", "shape": [98568, 512], "dtype": "float32"}, {"name": "sequential/dense/bias", "shape": [512], "dtype": "float32"}, {"name": "sequential/dense_1/kernel", "shape": [512, 15], "dtype": "float32"}, {"name": "sequential/dense_1/bias", "shape": [15], "dtype": "float32"}]}]}